lvx/base/Catalogs/бит_ЧатыTelegram.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ЧатыTelegram</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_БотыTelegram</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусРегистрации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусРегистрацииТелеграм</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступныеКоманды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КомандаТелеграм</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_КомандыБотуТелеграм</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/Catalogs/бит_ЧатыTelegram/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция получает данные чата по переданному идектификатору.
// 
// Параметры:
//	ИдентификаторЧата - Число - Идентификатор чата.
//	Бот - СправочникСсылка.бит_БотыTelegram.
// 
// Возвращаемое значение:
//	Структура:
//	 Чат - СправочникСсылка.бит_ЧатыTelegram.
//	 СтатусРегистрации - ПеречислениеСсылка.бит_СтатусРегистрацииТелеграм.
//
Функция ДанныеЧатаПоИдентификатору(ИдентификаторЧата, Бот = Неопределено) Экспорт
	
	ДанныеЧата = Новый Структура;
	ДанныеЧата.Вставить("Чат",               Справочники.бит_ЧатыTelegram.ПустаяСсылка());
	ДанныеЧата.Вставить("СтатусРегистрации", Перечисления.бит_СтатусРегистрацииТелеграм.ПустаяСсылка());
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторЧата) Тогда
		Возврат ДанныеЧата;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЧатыTelegram.Ссылка КАК Чат,
	|	ЧатыTelegram.СтатусРегистрации КАК СтатусРегистрации
	|ИЗ
	|	Справочник.бит_ЧатыTelegram КАК ЧатыTelegram
	|ГДЕ
	|	ЧатыTelegram.ИД = &ИдентификаторЧата
	|	И &УсловиеОграниченияПоБоту
	|	И НЕ ЧатыTelegram.ПометкаУдаления";
	Запрос.УстановитьПараметр("ИдентификаторЧата", ИдентификаторЧата);
	Если НЕ ЗначениеЗаполнено(Бот) Тогда
		ТекстУсловия = "Истина";
	Иначе
		ТекстУсловия = "ЧатыTelegram.ОсновнойБот = &Бот";
		Запрос.УстановитьПараметр("Бот", Бот);
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеОграниченияПоБоту", ТекстУсловия);
		
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДанныеЧата.Чат               = Выборка.Чат;
		ДанныеЧата.СтатусРегистрации = Выборка.СтатусРегистрации;
	КонецЕсли;
	
	Возврат ДанныеЧата;		
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция определяет обязательность заполнения реквизита Пользователя.
// 
// Параметры:
//	КомандыЧата - Массив - Массив доступных команд чата.
// 
// Возвращаемое значение:
//	Булево.
// 
Функция ОбязательноЗаполнениеПользователя(КомандыЧата) Экспорт
	
	ОписаниеКоманд = Справочники.бит_КомандыБотуТелеграм.ОписаниеПредопределенныхКоманд();
	
	Запрос         = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОписаниеКоманд.Команда КАК Команда,
	|	ОписаниеКоманд.ПользовательОбязателен КАК ПользовательОбязателен
	|ПОМЕСТИТЬ ОписаниеКоманд
	|ИЗ
	|	&ОписаниеКоманд КАК ОписаниеКоманд";
	Запрос.УстановитьПараметр("ОписаниеКоманд", ОписаниеКоманд);
	Запрос.Выполнить();
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОписаниеКоманд.Команда КАК Команда
	|ИЗ
	|	ОписаниеКоманд КАК ОписаниеКоманд
	|ГДЕ
	|	ОписаниеКоманд.ПользовательОбязателен
	|	И ОписаниеКоманд.Команда В(&КомандыЧата)";
	Запрос.УстановитьПараметр("КомандыЧата",    КомандыЧата);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли
